#  Operacoes

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df.info() # verificar se esta trab com object (string) ou  numeros

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [4]:
df.memory_usage()

Index    132
col1      32
col2      32
col3      32
dtype: int64

In [5]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [6]:
# lista de valores unicos do DF e ordenar
df["col2"].unique()

array([444, 555, 666])

In [8]:
# qtos valores unicos existe, o len da lista
df["col2"].nunique()

3

In [9]:
# contagem de cada elemento (SERIES)
df["col2"].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [10]:
df["col2"].value_counts().index

Index([444, 555, 666], dtype='int64', name='col2')

# Aplicando Funcoes

In [11]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [12]:
def comp(x):
    return x ** 2 + 3

In [13]:
comp # comando assim tem o ponteiro dela e assim comp() eu estou tentanto executar ela

In [14]:
df["col1"].apply(comp)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [15]:
# aplicar calc em uma coluna
df["col1_calc"] = df["col1"].apply(comp)
# grava o novo valor na coluna

In [16]:
df

   col1  col2 col3  col1_calc
0     1   444  abc          4
1     2   555  def          7
2     3   666  ghi         12
3     4   444  xyz         19

In [17]:
# lambda => executa a funcao e depois ela vai ser deletada, reduzindo o calculo em uma linha
df["col1"].apply(lambda x: x ** 2 + 3)

0     4
1     7
2    12
3    19
Name: col1, dtype: int64

In [18]:
df

   col1  col2 col3  col1_calc
0     1   444  abc          4
1     2   555  def          7
2     3   666  ghi         12
3     4   444  xyz         19

# funcoes numericas

In [19]:
# calcular todo o product 
df["col1"].product() # 2 * 3 * 4 = 24

np.int64(24)

In [21]:
df["col1"].mean() # media

np.float64(2.5)

In [22]:
df["col1"].sum()

np.int64(10)

In [26]:
df["col1"].std() # desvio estatistica

np.float64(1.2909944487358056)

In [27]:
df["col1"].max()

np.int64(4)

In [28]:
df["col1"].idxmax() #qual o indice min que tenho o max

3

In [30]:
df["col1"].min()

np.int64(1)

In [ ]:
# fazer filtros dos numeros, combinatorio

In [31]:
df

   col1  col2 col3  col1_calc
0     1   444  abc          4
1     2   555  def          7
2     3   666  ghi         12
3     4   444  xyz         19

In [32]:
df[df["col2"] == 444] # Este código filtra o DataFrame df e retorna apenas as linhas onde o valor da coluna "col2" é igual a 444.

   col1  col2 col3  col1_calc
0     1   444  abc          4
3     4   444  xyz         19

In [34]:
# Esse comando retorna a soma dos valores da coluna col1 apenas nas linhas onde col2 é 444.
df[df["col2"] == 444] ["col1"].sum()

np.int64(5)

In [35]:
# ordenacao de colunas
df.sort_values(by="col2") # ordenacao coluna 2

   col1  col2 col3  col1_calc
0     1   444  abc          4
3     4   444  xyz         19
1     2   555  def          7
2     3   666  ghi         12

In [36]:
# outra DF

In [37]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [38]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [ ]:
# fazer um mapeamento de acordo com date acima
# orientacoes com dict_map => sempre que ele ver o valor 1 sub por 1, se ver valor 2 sub por 2

In [39]:
dict_map = {"one": "1", "two": "2"}

In [40]:
df["B"].map(dict_map)

0    1
1    1
2    2
3    2
4    1
5    1
Name: B, dtype: object

In [41]:
# criando uma coluna E e colocar os dados
df["E"] = df["B"].map(dict_map)

In [42]:
df

     A    B  C  D  E
0  foo  one  x  1  1
1  foo  one  y  3  1
2  foo  two  x  2  2
3  bar  two  y  5  2
4  bar  one  x  4  1
5  bar  one  y  1  1

In [43]:
# pivot_table => reorganizar os dados da tabela
df.pivot_table(index="A", columns="B", values="D")
#Ela agrupa os dados e os organiza em formato de tabela bidimensional, com linhas (index), colunas (columns), e valores numéricos (values) que normalmente são agregados (ex: somados, contados, etc.).

B    one  two
A
bar  2.5  5.0
foo  2.0  2.0